package com.example.basicproject

object CatRepository {

    fun getCats():ArrayList<Cat> = arrayListOf(
        Cat(1, "Британская кошка", "Великобритания", R.drawable.brit,"Британцы – классический случай национального характера, отлитого в кошке. Настоящие леди и джентльмены, со всеми чертами, присущими жителям Альбиона: невероятным чувством собственного достоинства, независимостью и самодостаточностью. Британец никогда не будет громко выпрашивать у вас еду или капризничать в одиночестве: он сумеет себя занять (причем, конечно, не катанием на шторах или порчей обоев!), а по возвращении хозяина с работы с помощью негромкого покряхтывания перескажет только самые важные новости.\n" +
                "\n" +
                "Хотя британцы и любят играть, постоянного внимания им не требуется. Если она в настроении играть, она найдет кого-то и принесет игрушку этому человеку. При этом они могут прекрасно развлекать сами себя, поэтому их можно считать хорошими компаньонами для одиноких людей.",R.drawable.ic_like),
        Cat(2, "Персидская кошка", "Germany", R.drawable.pers,"В 19 веке персидские кошки были любимцами европейской знати. Это царственные и очень горделивые животные с чувством собственного достоинства.\n" +
                "\n" +
                "Поведение персов принципиально отличается от поведения других кошек.\n" +
                "\n" +
                "Они не кричат и вообще крайне редко подают голос. Если персу что-то нужно от хозяина, он будет сидеть рядом и преданно смотреть ему в глаза, ожидая ответной реакции. С этим могут иногда возникать трудности, так как не все хозяева быстро понимают, что от них что-то требуется. Но, даже если и понимают, далее им предстоит решить загадку: что именно нравится или не нравится кошке. Хотя постепенно это становится делать все легче.\n" +
                "\n" +
                "Вообще, кажется, что эта порода была создана для неги и наслаждений: кошки не носятся ураганом по дому, не охотятся и с удовольствием проводят время, валяясь в каком-нибудь теплом приятном месте вместе с хозяином.\n" +
                "\n" +
                "Благодаря своему сдержанному характеру, персы создают в доме атмосферу уюта и спокойствия. Они никуда не торопятся, никогда не позволяют себе настойчиво требовать внимания от хозяина (хотя совсем не против, чтобы их гладили, чесали и всячески баловали). Это идеальная кошка для тех, кто не любит назойливость и чрезмерную активность подвижных пород.\n" +
                "\n" +
                "При всей своей вальяжности персы отлично усваивают базовые команды и всячески стараются угодить своему хозяину. Они были выведены исключительно как домашняя порода и считают своим главным предназначением радовать человека.\n" +
                "\n" +
                "Персы легко уживаются с другими животными и детьми. Очень терпеливо относятся к проявлению интереса к своей персоне. Агрессию позволяют себе проявлять только в крайних случаях.",R.drawable.ic_like),
        Cat(3, "Кошка рэгдолл", "Риверсайд", R.drawable.regd,"",R.drawable.ic_like),
        Cat(4, "Тайская кошка", "Таиланд", R.drawable.tais,"Тайские кошки относятся к древней породе кошек, упоминания о тайских кошках встречаются в рукописях 14 века, с которыми сегодня можно познакомится в Бангкоке. Про этих кошек слагались легенды, известно, они часто защищали дома людей, прогоняли недоброжелателей из храмов и монастырей. По сути это сиамские кошки в их первозданной красоте, именно такой вид имели сиамские кошки, которые прибыли в Европу в 19-20 веках и были увековечены на первых фотографиях. Многолетний труд фелинологов над породой сиамских кошек изменил первозданный вид этих созданий в сторону более экстремальных проявлений внешних признаков и черт, так голова стала иметь клиновидную форму, укрупнились уши, лапы стали более вытянутыми, общий образ кошек стал более утонченным. Но первозданную красоту сиамских кошек все же удалось сохранить благодаря ценителям этой красоты кошек с головой в форме яблока (apple-headed), именно эти кошки и называются сегодня тайскими. В России впервые тайские кошки появились в 18 веке в Пензенской области, при этом селекционеры у нас не занимались работой над этой породой вплоть до 1980-х годов. Поэтому внешность тайских кошек осталась в неизменном виде. В 1990 году кошки получили официальную регистрацию стандарта породы в WCF системе, это произошло в Германии, при этом было закреплено новое название породы «тайская кошка».",R.drawable.ic_like)
    )
}