package com.example.basicproject

object CatRepository {

    fun getCats():ArrayList<Cat> = arrayListOf(
        Cat(1, "Британская кошка", "Великобритания", R.drawable.brit,"Британцы – классический случай национального характера, отлитого в кошке. Настоящие леди и джентльмены, со всеми чертами, присущими жителям Альбиона: невероятным чувством собственного достоинства, независимостью и самодостаточностью. Британец никогда не будет громко выпрашивать у вас еду или капризничать в одиночестве: он сумеет себя занять (причем, конечно, не катанием на шторах или порчей обоев!), а по возвращении хозяина с работы с помощью негромкого покряхтывания перескажет только самые важные новости.\n" +
                "\n" +
                "Хотя британцы и любят играть, постоянного внимания им не требуется. Если она в настроении играть, она найдет кого-то и принесет игрушку этому человеку. При этом они могут прекрасно развлекать сами себя, поэтому их можно считать хорошими компаньонами для одиноких людей.",R.drawable.ic_like),
        Cat(2, "Персидская кошка", "Иран", R.drawable.pers,"В 19 веке персидские кошки были любимцами европейской знати. Это царственные и очень горделивые животные с чувством собственного достоинства.\n" +
                "\n" +
                "Поведение персов принципиально отличается от поведения других кошек.\n" +
                "\n" +
                "Они не кричат и вообще крайне редко подают голос. Если персу что-то нужно от хозяина, он будет сидеть рядом и преданно смотреть ему в глаза, ожидая ответной реакции. С этим могут иногда возникать трудности, так как не все хозяева быстро понимают, что от них что-то требуется. Но, даже если и понимают, далее им предстоит решить загадку: что именно нравится или не нравится кошке. Хотя постепенно это становится делать все легче.\n" +
                "\n" +
                "Вообще, кажется, что эта порода была создана для неги и наслаждений: кошки не носятся ураганом по дому, не охотятся и с удовольствием проводят время, валяясь в каком-нибудь теплом приятном месте вместе с хозяином.\n" +
                "\n" +
                "Благодаря своему сдержанному характеру, персы создают в доме атмосферу уюта и спокойствия. Они никуда не торопятся, никогда не позволяют себе настойчиво требовать внимания от хозяина (хотя совсем не против, чтобы их гладили, чесали и всячески баловали). Это идеальная кошка для тех, кто не любит назойливость и чрезмерную активность подвижных пород.\n" +
                "\n" +
                "При всей своей вальяжности персы отлично усваивают базовые команды и всячески стараются угодить своему хозяину. Они были выведены исключительно как домашняя порода и считают своим главным предназначением радовать человека.\n" +
                "\n" +
                "Персы легко уживаются с другими животными и детьми. Очень терпеливо относятся к проявлению интереса к своей персоне. Агрессию позволяют себе проявлять только в крайних случаях.",R.drawable.ic_like),
        Cat(3, "Кошка рэгдолл", "Риверсайд", R.drawable.regd,"Кошки породы рэгдолл — привязчивые и тихие, отличаются очень невозмутимым характером. Они общительны и любят находиться в обществе не только своих владельцев, но и гостей.\n" +
                "\n" +
                "Рэгдоллы славятся терпимостью по отношению к другим животным и особенно хорошо ладят с детьми. Благодаря дружелюбию и уму их нередко сравнивают с собаками. Рэгдоллы умеренно подвижны и ежедневно ограничиваются несколькими минутами активных игр. Чаще всего они предпочитают играть лежа на спине.",R.drawable.ic_like),
        Cat(4, "Тайская кошка", "Таиланд", R.drawable.tais,"Тайская кошка очень ласковая и прекрасно поладит не только со всеми членами вашей семьи, но и с другими домашними животными. Стоит учесть: выстраивая свои отношения с остальными питомцами, она будет стремиться к доминированию, что в большинстве случаев прекрасно ей удается.\n" +
                "В отношениях с человеком тайская кошка поразительно миролюбива. Пожалуй, это одна из немногих пород, представители которой привязываются именно к хозяину, а не к месту обитания.\n" +
                "У тайской кошки отсутствует раздражающая привычка метить свою территорию.\n" +
                "Легендой стала неуемная любознательность тайца. Непонятно, что руководит животным в первую очередь – инстинкт самосохранения или желание узнать что-то новое для себя. Именно с этой чертой характера связаны почти все случаи травматизма у тайских кошек.",R.drawable.ic_like)
    )
}